package com.company;

public class Test {
    public static void main(String[] args) {
        MathUtil.factorial();
        MathUtil.geometric();
        MathUtil.arithmetic();
    }
}
//    Текущая программа состоит из следующих классов:
//        Test– точка входа в приложение, именно здесь мы будем работать с нашим
//        функционалом.
//        MathUtil– Util-класс в котором реализованы методы для выполнения арифметических
//        последовательностей и других операций с циклами:
//        * Реализовать методы математических последовательностей (факториал ||
//        геометрическая прогрессия || арифметическая прогрессия)
//        Проверить выполнение методов в главном классе, с несколькими наборами
//        параметров. 